gen_datasets/generate_data_3d/flow_over_plate/original_snappy/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    geometry_z_top
    {
        type            noSlip;
    }
    geometry_z_bot
    {
        type            noSlip;
    }
    geometry_y_bot
    {
        type            noSlip;
    }
    geometry_inlet
    {
        type            fixedValue;
        value           uniform (1 0 0);
    }
    geometry_y_top
    {
        type            noSlip;
    }
    geometry_outlet
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
    geometry_obstacle
    {
        type            noSlip;
    }
}


// ************************************************************************* //
